Repository: NatLibFi/ekirjasto-circulation
Catalog: translations/*/LC_MESSAGES/circulation-admin.po
Languages: fi, sv

source: Invalid announcement list format: %(announcements)r
fi: Virheellinen ilmoitusluettelon muoto: %(announcements)r
sv: Ogiltigt format för meddelandelista: %(announcements)r

source: Too many announcements: maximum is %(maximum)d
fi: Liian monta ilmoitusta: enimmäismäärä on %(maximum)d
sv: För många meddelanden: max. %(maximum)d

source: Duplicate announcement ID: %s
fi: Kaksi ilmoitustunnusta: %s
sv: Dubbla meddelande-ID: %s

source: Invalid announcement format: %(announcement)r
fi: Virheellinen ilmoitusmuoto: %(announcement)r
sv: Ogiltigt meddelandeformat: %(announcement)r

source: Invalid announcement ID: %(id)s
fi: Virheellinen ilmoitustunnus: %(id)s
sv: Ogiltigt meddelande-ID: %(id)s

source: Missing required field: %(field)s
fi: Pakollinen kenttä puuttuu: %(field)s
sv: Obligatoriskt fält saknas: %(field)s

source: Value too short (%(length)d versus %(limit)d characters): %(value)s
fi: Liian lyhyt arvo (%(length)d vs. %(limit)d merkkiä): %(value)s
sv: Värdet är för kort (%(length)d vs %(limit)d tecken): %(value)s

source: Value too long (%(length)d versus %(limit)d characters): %(value)s
fi: Liian pitkä arvo (%(length)d vs. %(limit)d merkkiä): %(value)s
sv: Värdet är för långt (%(length)d vs %(limit)d tecken): %(value)s

source: Value for %(field)s is not a date: %(date)s
fi: Kentän %(field)s arvo ei ole päivämäärä: %(date)s
sv: Värdet för %(field)s är inte ett datum: %(date)s

source: Value for %(field)s must be no earlier than %(minimum)s
fi: Kentän %(field)s arvo saa olla aikaisintaan %(minimum)s
sv: Värdet för %(field)s får inte vara tidigare än %(minimum)s

source: Admin auth not configured
fi: Ylläpitäjän todennusta ei ole määritetty
sv: Administratörens autentisering har inte konfigurerats

source: This circulation manager has not been configured to authenticate admins.
fi: Tätä lainauksen hallintaa ei ole määritetty todentamaan ylläpitäjiä.
sv: Denna utlåningshanterare har inte konfigurerats för att autentisera administratörer.

source: Admin auth mechanism not configured
fi: Ylläpitäjän todennusmekanismia ei ole määritetty
sv: Mekanismen för autentisering av administratörer har inte konfigurerats

source: This circulation manager has not been configured to authenticate admins with the mechanism you used
fi: Tätä lainauksen hallintaa ei ole määritetty todentamaan ylläpitäjiä käyttämälläsi mekanismilla
sv: Denna utlåningshanterare har inte konfigurerats för att autentisera administratörer med mekanismen du använde

source: Invalid admin credentials
fi: Virheelliset ylläpitäjän kirjautumistiedot
sv: Ogiltiga identifieringsuppgifter för administratör

source: Valid library staff credentials are required.
fi: Kelvolliset kirjastohenkilökunnan kirjautumistiedot vaaditaan.
sv: Giltiga identifieringsuppgifter för bibliotekspersonal krävs.

source: Admin not authorized
fi: Ylläpitäjää ei ole valtuutettu
sv: Administratören är inte auktoriserad

source: Your admin account is not authorized to make this request.
fi: Ylläpitäjätililläsi ei ole oikeutta tehdä tätä pyyntöä.
sv: Ditt adminstratörskonto saknar behörighet för att göra denna begäran.

source: Invalid CSRF token
fi: Virheellinen CSRF-tunnus
sv: Ogiltigt CSRF-token

source: There was an error saving your changes.
fi: Muutostesi tallentamisessa tapahtui virhe.
sv: Det gick inte att spara dina ändringar.

source: Invalid edit
fi: Virheellinen muokkaus
sv: Ogiltig ändring

source: There was a problem with the edited metadata.
fi: Muokatuissa metatiedoissa oli ongelma.
sv: Något gick fel med de ändrade metadata.

source: Metadata refresh pending.
fi: Metatietojen päivitys odottaa.
sv: Metadata väntar på uppdatering.

source: The Metadata Wrangler is looking for new data. Check back later.
fi: Metadata Wrangler etsii uusia tietoja. Palaa myöhemmin takaisin.
sv: Metadata Wrangler söker nya data. Kom tillbaka om en stund.

source: Metadata could not be refreshed.
fi: Metatietoja ei voitu päivittää.
sv: Metadata kunde inte uppdateras.

source: Genre not found.
fi: Genreä ei löytynyt.
sv: Genren hittades inte.

source: One of the submitted genres does not exist.
fi: Yhtä annetuista genreistä ei ole olemassa.
sv: En av genrerna som angetts finns inte.

source: Incompatible genre.
fi: Yhteensopimaton genre.
sv: Inkompatibel genre.

source: The genre is incompatible with the fiction status of the work.
fi: Genre ei sovi yhteen teoksen fiktiivisen tilan kanssa.
sv: Genren är inkompatibel med verkets skönlitterära status.

source: Erotica is for Adults Only.
fi: Erotiikka on tarkoitettu vain aikuisille.
sv: Erotik är endast avsedd för vuxna.

source: The Erotica genre is incompatible with the submitted Audience.
fi: Erotiikka-genre ei sovi yhteen annetun yleisön kanssa.
sv: Genren erotik är inkompatibel med den angivna läsekretsen.

source: Invalid series position.
fi: Virheellinen sarjan sijainti.
sv: Ogiltig position i serien.

source: The series position must be a number or blank.
fi: Sarjan sijainnin on oltava numero tai tyhjä.
sv: Positionen i serien måste vara ett nummer eller tom.

source: Invalid date format.
fi: Virheellinen päivämäärämuoto.
sv: Ogiltigt datumformat.

source: A date must be in the format YYYY-MM-DD.
fi: Päivämäärän on oltava muodossa VVVV-KK-PP.
sv: Ett datum ska vara i formatet ÅÅÅÅ-MM-DD.

source: Unknown language.
fi: Tuntematon kieli.
sv: Okänt språk.

source: The submitted language is not one of the known languages.
fi: Annettu kieli ei ole mikään tunnetuista kielistä.
sv: Det angivna språket finns inte med bland de kända språken.

source: Unknown location.
fi: Tuntematon sijainti.
sv: Okänd plats.

source: The submitted geographic location cannot be found.
fi: Annettua maantieteellistä sijaintia ei löydy.
sv: Den angivna geografiska positionen kan inte hittas.

source: Unknown role.
fi: Tuntematon rooli.
sv: Okänd roll.

source: One of the submitted roles is not one of the known roles.
fi: Yksi annetuista rooleista ei kuulu tunnettuihin rooleihin.
sv: En av de angivna rollerna finns inte med bland de kända rollerna.

source: Unknown medium.
fi: Tuntematon media.
sv: Okänt medium.

source: The submitted medium is not one of the known media types.
fi: Annettu media ei kuulu tunnettuihin mediatyyppeihin.
sv: Det angivna mediet finns inte med bland de kända medierna.

source: Invalid rating.
fi: Virheellinen arviointi.
sv: Ogiltigt betyg.

source: The rating must be a number in the rating scale.
fi: Arvioinnin on oltava arviointiasteikon numero.
sv: Betyget ska vara en siffra i betygsskalan.

source: Invalid image
fi: Virheellinen kuva
sv: Ogiltig bild

source: The submitted image is invalid.
fi: Annettu kuva on virheellinen.
sv: Den angivna bilden är ogiltig.

source: Library short name already in use
fi: Kirjaston lyhyt nimi on jo käytössä
sv: Bibliotekets kortnamn används redan

source: The library short name must be unique, and there's already a library with the specified short name.
fi: Kirjaston lyhyen nimen on oltava yksilöllinen, ja kyseisellä lyhyellä nimellä löytyy jo kirjasto.
sv: Bibliotekets kortnamn ska var unikt. Det finns redan ett bibliotek med detta kortnamn.

source: Missing collection.
fi: Kokoelma puuttuu.
sv: Samling saknas.

source: The specified collection does not exist.
fi: Määritettyä kokoelmaa ei ole.
sv: Denna samling finns inte.

source: Missing analytics name.
fi: Analytiikan nimi puuttuu.
sv: Analysnamn saknas.

source: You must identify the analytics service by its name.
fi: Analytiikkapalvelu on yksilöitävä nimellä.
sv: Du måste identifiera analystjänsten med dess namn.

source: Cannot delete collection with children
fi: Emokokoelmaa ei voi poistaa
sv: Det går inte att radera en samling med barn

source: The collection is the parent of at least one other collection, so it can't be deleted.
fi: Kokoelma on vähintään yhden kokoelman emokokoelma, joten sitä ei voi poistaa.
sv: Samlingen är förälder till minst en annan samling och kan därför inte raderas.

source: No protocol for new service
fi: Uudella palvelulla ei ole protokollaa
sv: Protokoll saknas för ny tjänst

source: The specified service doesn't exist. You can create it, but you must specify a protocol.
fi: Määritettyä palvelua ei ole. Voit luoda sen, mutta sinun on määritettävä protokolla.
sv: Denna tjänst finns inte. Du kan skapa den, men du måste ange ett protokoll.

source: Unknown protocol
fi: Tuntematon protokolla
sv: Okänt protokoll

source: The protocol is not one of the known protocols.
fi: Protokolla ei kuulu tunnettuihin protokolliin.
sv: Detta protokoll finns inte med bland de kända protokollen.

source: Cannot change protocol
fi: Protokollaa ei voi vaihtaa
sv: Det går inte att ändra protokollet

source: A protocol can't be changed once it has been set.
fi: Protokollaa ei voi vaihtaa sen määrittämisen jälkeen.
sv: Ett protokoll kan inte ändras efter att det har fastställts.

source: Missing service name.
fi: Palvelun nimi puuttuu.
sv: Tjänstens namn saknas.

source: You must identify the service by its name.
fi: Palvelu on yksilöitävä nimellä.
sv: Du måste identifiera tjänsten med dess namn.

source: Protocol does not support parents
fi: Protokolla ei tue emoprotokollia
sv: Protokollet stöder inte föräldrar

source: You attempted to add a parent but the protocol does not support parents.
fi: Yritit lisätä emoprotokollan, mutta protokolla ei tue sitä.
sv: Du försökte lägga till en förälder men protokollet stöder inte föräldrar.

source: Protocol does not support settings
fi: Protokolla ei tue asetuksia
sv: Protokollet stöder inte inställningar

source: You attempted to update settings for a protocol that does not support settings.
fi: Yritit päivittää sellaisen protokollan asetuksia, joka ei tue asetuksia.
sv: Du försökte uppdatera inställningarna för ett protokoll som inte stöder inställningar.

source: Missing parent
fi: Emo puuttuu
sv: Förälder saknas

source: You attempted to add a parent that does not exist.
fi: Yritit lisätä emon, jota ei ole.
sv: Du försökte lägga till en förälder som inte finns.

source: No such library
fi: Tällaista kirjastoa ei ole
sv: Det finns inte något sådant bibliotek

source: A library in your request does not exist.
fi: Pyyntösi kirjastoa ei ole.
sv: Ett bibliotek i din begäran finns inte.

source: Incomplete configuration
fi: Vaillinainen kokoonpano
sv: Ofullständig konfiguration

source: The configuration is missing a required field.
fi: Kokoonpanosta puuttuu pakollinen kenttä.
sv: Konfigurationen saknar ett obligatoriskt fält.

source: Duplicate integration
fi: Kaksi integraatiota
sv: Upprepa integrationen

source: A given site can only support one integration of this type.
fi: Sivusto tukee vain yhtä tämäntyyppistä integraatiota.
sv: En given webbplats kan endast stöda en integration av den här typen.

source: Integration name already in use
fi: Integraation nimi on jo käytössä
sv: Integrationens namn används redan

source: The integration name must be unique, and there's already an integration with the specified name.
fi: Integraation nimen on oltava yksilöllinen, ja kyseisellä nimellä löytyy jo integraatio.
sv: Integrationens namn ska vara unikt. Det finns redan en integration med detta namn.

source: Integration URL already in use
fi: Integraation URL-osoite on jo käytössä
sv: Integrationens URL används redan

source: There's already an integration of this type for this URL.
fi: Tällä URL-osoitteella on jo tämäntyyppinen integraatio.
sv: Det finns redan en integration med den här typen av URL.

source: Incompatible use of integration
fi: Integraation yhteensopimaton käyttö
sv: Integrationen används på ett inkompatibelt sätt

source: You tried to use an integration in a way incompatible with the goal of that integration
fi: Yritit käyttää integraatiota tavalla, joka ei ole yhteensopiva integraation tavoitteen kanssa
sv: Du försökte använda en integration på ett sätt som är inkompatibelt med integrationens syfte

source: Missing integration
fi: Integraatio puuttuu
sv: Integrationen saknas

source: The specified integration does not exist.
fi: Määritettyä integraatiota ei ole.
sv: Denna integration finns inte.

source: Missing pgcrypto database extension
fi: Tietokannan pgcrypto-laajennus puuttuu
sv: Databastillägget pgcrypto saknas

source: You tried to store a password for an individual admin, but the database does not have the pgcrypto extension installed.
fi: Yritit tallentaa salasanan yksittäiselle ylläpitäjälle, mutta tietokantaan ei ole asennettu pgcrypto-laajennusta.
sv: Du försökte spara ett lösenord för en enskild administratör, men det finns inget pgcrypto-tillägg installerat för databasen.

source: Missing admin
fi: Ylläpitäjä puuttuu
sv: Administratör saknas

source: The specified admin does not exist.
fi: Määritettyä ylläpitäjää ei ole.
sv: Den angivna administratören finns inte.

source: Missing service
fi: Palvelu puuttuu
sv: Tjänsten saknas

source: The specified service does not exist.
fi: Määritettyä palvelua ei ole.
sv: Den angivna tjänsten finns inte.

source: Invalid configuration option
fi: Virheellinen kokoonpanoasetus
sv: Ogiltigt konfigurationsalternativ

source: The configuration has an invalid value.
fi: Kokoonpanossa on virheellinen arvo.
sv: Konfigurationen har ett ogiltigt värde.

source: Invalid email format
fi: Virheellinen sähköpostimuoto
sv: Ogiltigt e-postformat

source: You must enter a valid email address.
fi: Sinun on annettava kelvollinen sähköpostiosoite.
sv: Du måste ange en giltig e-postadress.

source: Invalid URL format
fi: Virheellinen URL-muoto
sv: Ogiltigt URL-format

source: You must enter a valid URL.
fi: Sinun on annettava kelvollinen URL-osoite.
sv: Du måste ange en giltig URL.

source: Invalid number format
fi: Virheellinen numeromuoto
sv: Ogiltigt nummerformat

source: You must enter a number.
fi: Sinun on annettava numero.
sv: Du måste ange ett nummer.

source: Invalid external type regular expression
fi: Virheellinen ulkoisen tyypin säännöllinen lauseke
sv: Ogiltigt reguljärt uttryck av extern typ

source: The specified external type regular expression does not compile.
fi: Määritetty ulkoisen tyypin säännöllinen lauseke ei toimi oikein.
sv: Detta reguljära uttryck av extern typ går inte att kompilera.

source: Invalid library identifier restriction regular expression
fi: Virheellinen kirjaston tunnisteen rajoituksen säännöllinen lauseke
sv: Ogiltigt reguljärt uttryck för begränsning av biblioteksidentifierare

source: The specified library identifier restriction regular expression does not compile.
fi: Määritetty kirjaston tunnisteen rajoituksen säännöllinen lauseke ei toimi oikein.
sv: Detta reguljära uttryck för begränsning av biblioteksidentifieraren går inte att kompilera.

source: Multiple basic authentication services
fi: Useita perustodennuspalveluita
sv: Flera grundläggande autentiseringstjänster

source: Each library can only have one patron authentication service using basic auth.
fi: Jokaisella kirjastolla voi olla vain yksi perustodennusta käyttävä asiakastodennuspalvelu.
sv: Varje bibliotek kan endast ha en autentiseringstjänst för kunder som använder grundläggande autentisering.

source: No such patron
fi: Tällaista asiakasta ei ole
sv: Det finns inte någon sådan kund

source: The specified patron doesn't exist, or is associated with a different library.
fi: Määritettyä asiakasta ei ole tai se on yhdistetty toiseen kirjastoon.
sv: Denna kund finns inte eller är kopplad till ett annat bibliotek.

source: Missing sitewide setting key
fi: Sivustonlaajuisen asetuksen avain puuttuu
sv: Inställningsnyckel för webbplatsen saknas

source: A key is required to change a sitewide setting.
fi: Sivustonlaajuisen asetuksen muuttaminen edellyttää avainta.
sv: Det behövs en nyckel för att ändra en inställning för hela webbplatsen.

source: Missing sitewide setting value
fi: Sivustonlaajuisen asetuksen arvo puuttuu
sv: Inställningsvärde för hela webbplatsen saknas

source: A value is required to change a sitewide setting.
fi: Sivustonlaajuisen asetuksen muuttaminen edellyttää arvoa.
sv: Det behövs ett värde för att ändra en inställning för hela webbplatsen.

source: Multiple sitewide services
fi: Useita sivustonlaajuisia palveluja
sv: Flera likadana tjänster för hela webbplatsen

source: You tried to create a new sitewide service, but a sitewide service of the same type is already configured.
fi: Yritit luoda uuden sivustonlaajuisen palvelun, mutta samantyyppinen sivustonlaajuinen palvelu on jo määritetty.
sv: Du försökte skapa en ny tjänst för hela webbplatsen, men en tjänst för hela webbplatsen av samma typ har redan konfigurerats.

source: Multiple services for library
fi: Kirjastolla useita palveluja
sv: Flera likadana tjänster för biblioteket

source: Each library can only have one service of this type.
fi: Jokaisella kirjastolla voi olla vain yksi tämäntyyppinen palvelu.
sv: Varje bibliotek kan endast ha en tjänst av den här typen.

source: Missing custom list
fi: Mukautettu luettelo puuttuu
sv: Anpassad lista saknas

source: The specified custom list doesn't exist.
fi: Määritettyä mukautettua luetteloa ei ole.
sv: Den angivna anpassade listan finns inte.

source: Cannot change library for custom list
fi: Mukautetun luettelon kirjastoa ei voi muuttaa
sv: Det går inte att byta ut biblioteket mot en anpassad lista

source: A custom list's associated library cannot be changed once it is set..
fi: Mukautettuun luetteloon liitettyä kirjastoa ei voi muuttaa sen määrittämisen jälkeen.
sv: En anpassad listas associerade bibliotek kan inte ändras efter att det fastställts.

source: Custom list name already in use
fi: Mukautetun luettelon nimi on jo käytössä
sv: Den anpassade listans namn används redan

source: The library already has a custom list with that name.
fi: Kirjastossa on jo tämänniminen mukautettu luettelo.
sv: Biblioteket har redan en anpassad lista med detta namn.

source: An auto update custom list cannot have entries
fi: Automaattisesti päivittyvässä mukautetussa luettelossa ei voi olla merkintöjä
sv: En anpassad lista med automatisk uppdatering kan inte ha poster

source: Entries are automatically managed for auto update custom lists
fi: Automaattisesti päivittyvien mukautettujen luetteloiden merkintöjä hallinnoidaan automaattisesti
sv: Poster hanteras automatiskt för anpassade listor med automatisk uppdatering

source: Collection not associated with library
fi: Kokoelmaa ei ole liitetty kirjastoon
sv: Samlingen är inte associerad med ett bibliotek

source: You can't add a collection to a list unless it is associated with the list's library.
fi: Et voi lisätä kokoelmaa luetteloon, ellei sitä ole liitetty luettelon kirjastoon.
sv: Du kan inte lägga till en samling till en lista såvida den inte är associerad med listans bibliotek.

source: Missing lane
fi: Kaista puuttuu
sv: Band saknas

source: The specified lane doesn't exist, or is associated with a different library.
fi: Määritettyä kaistaa ei ole tai se on yhdistetty toiseen kirjastoon.
sv: Detta band finns inte eller är associerat med ett annat bibliotek.

source: Cannot edit default lane
fi: Oletuskaistaa ei voi muokata
sv: Det går inte att redigera standardband

source: You can't change one of the default auto-generated lanes.
fi: Et voi muuttaa yhtä automaattisesti luoduista oletuskaistoista.
sv: Du kan inte ändra en av de förinställda autogenererade banden.

source: No display name for lane
fi: Kaistalla ei ole näyttönimeä
sv: Skärmnamn för bandet saknas

source: A custom lane must have a name.
fi: Mukautetulla kaistalla on oltava nimi.
sv: Ett anpassat band måste ha ett namn.

source: No custom lists for lane
fi: Kaistalla ei ole mukautettuja luetteloita
sv: Bandet saknar anpassade listor

source: A custom lane must have at least one associated list.
fi: Mukautetulla kaistalla on oltava vähintään yksi siihen liitetty luettelo.
sv: Ett anpassat band måste ha minst en associerad lista.

source: Lane with parent and display name already exists
fi: Kaista, jolla on sama emo- ja näyttönimi, on jo olemassa
sv: Ett band med förälder och skärmnamn finns redan

source: You cannot create a lane with the same parent and display name as an existing lane.
fi: Et voi luoda kaistaa, jolla on sama emo- ja näyttönimi kuin olemassa olevalla kaistalla.
sv: Du kan inte skapa ett band med samma förälder och skärmnamn som ett befintligt band

source: Cannot show lane with hidden parent
fi: Kaistaa ei voi näyttää, jos emo on piilotettu
sv: Det går inte att visa band med dold förälder

source: You can only make a lane visible if its parent is already visible.
fi: Voit tehdä kaistan näkyväksi vain, jos sen emo on jo näkyvä.
sv: Du kan endast göra ett band synligt om dess förälder redan är synlig.

source: The collection does not support registration
fi: Kokoelma ei tue rekisteröintiä
sv: Samlingen stöder inte registrering

source: The collection does not support registration.
fi: Kokoelma ei tue rekisteröintiä.
sv: Samlingen stöder inte registrering.

source: Failed to run self tests.
fi: Itsetestien suorittaminen epäonnistui.
sv: Självtest misslyckades

source: Missing identifier
fi: Tunniste puuttuu
sv: Identifierare saknas

source: No identifier was used.
fi: Tunnistetta ei käytetty.
sv: Ingen identifierare användes.

source: Source collection missing
fi: Lähdekokoelma puuttuu
sv: Källsamling saknas

source: A source collection is not present in the library.
fi: Kirjastossa ei ole lähdekokoelmaa.
sv: Det saknas en källsamling i biblioteket.

source: Entry not valid for library
fi: Merkintä ei ole voimassa kirjastossa
sv: Posten är ogiltig för biblioteket

source: An entry in the customlist was not valid for the library being shared with.
fi: Mukautetun luettelon merkintä ei ollut voimassa jaettavassa kirjastossa.
sv: En post i den anpassade listan var ogiltig för biblioteket som det delas med.

source: Cannot delete the Custom List share
fi: Mukautetun luettelon jakamista ei voi poistaa
sv: Det går inte att radera delningen av anpassad lista

source: Unable to delete the shared status of the given list
fi: Luettelon jaettua tilaa ei voi poistaa
sv: Det går inte att radera delad status för den givna listan

source: "%(email)s" is not a valid email address.
fi: %(email)s ei ole kelvollinen sähköpostiosoite.
sv: "%(email)s" är inte en giltig e-postadress.

source: "%(url)s" is not a valid URL.
fi: %(url)s ei ole kelvollinen URL-osoite.
sv: "%(url)s" är inte en giltig URL.

source: "%(number)s" is not a number.
fi: %(number)s ei ole numero.
sv: "%(number)s" är inte ett nummer.

source: %(field)s must be greater than %(min)s.
fi: %(field)s on oltava suurempi kuin %(min)s.
sv: %(field)s måste vara större än %(min)s.

source: %(field)s cannot be greater than %(max)s.
fi: %(field)s ei voi olla suurempi kuin %(max)s.
sv: %(field)s får inte vara större än %(max)s.
