Repository: NatLibFi/ekirjasto-circulation
Catalog: translations/*/LC_MESSAGES/circulation.po
Languages: sv

source: SAML providers are configured, but secret for signing bearer tokens is not.
sv: SAML-leverantörer har konfigurerats, men inte krypteringskoden för att signera bearer tokens.

source: No SAML providers are configured.
sv: Inga SAML-leverantörer har konfigurerats.

source: The known providers are: %s
sv: Kända leverantörer är: %s

source: Library
sv: Bibliotek

source: Username
sv: Användarnamn

source: Password
sv: Lösenord

source: Library ID
sv: Biblioteks-ID

source: Verify SSL Certificate
sv: Verifiera SSL-certifikat

source: This should always be True in production, it may need to be set to False to use theAxis 360 QA Environment.
sv: Detta borde alltid vara Sant i produktionen. Man kan behöva ändra värdet till Falskt för att kunna använda Axis 360 QA-miljön.

source: True
sv: Sant

source: False
sv: Falskt

source: Account ID
sv: Konto-ID

source: Account Key
sv: Kontonyckel

source: Show/Hide Titles with No Available Loans
sv: Visa/Dölj titlar som inte kan lånas

source: Titles with no available loans will not be displayed in the Catalog view.
sv: Titlar som inte kan lånas visas inte i katalogvyn.

source: Ebook Loan Duration (in Days)
sv: Lånetid för e-böcker (dagar)

source: When a patron uses SimplyE to borrow an ebook from this collection, SimplyE will ask for a loan that lasts this number of days. This must be equal to or less than the maximum loan duration negotiated with the distributor.
sv: När en kund använder SimplyE för att låna en e-bok från denna samling kommer SimplyE att be om ett lån som varar så här många dagar. Detta måste vara lika eller mindre än den maximala lånetiden som avtalats med distributören.

source: Default Loan Period (in Days)
sv: Standard lånetid (dagar)

source: Until it hears otherwise from the distributor, this server will assume that any given loan for this library from this collection will last this number of days. This number is usually a negotiated value between the library and the distributor. This only affects estimates&mdash;it cannot affect the actual length of loans.
sv: Tills denna server hör annat från distributören kommer den att anta att ett lån för detta bibliotek från denna samling kommer att vara så här länge. Detta nummer är vanligtvis ett värde som avtalats mellan biblioteket och distributören. Detta påverkar endast estimates&mdash; det kan inte påverka lånens faktiska längd.

source: Could not map delivery mechanism %(mechanism_name)s to internal delivery mechanism!
sv: Leveransmekanismen %(mechanism_name)s kunde inte fastställas som intern leveransmekanism!

source: You cannot renew a loan if other patrons have the work on hold.
sv: Du kan inte förnya lånet om en annan kund har reserverat verket.

source: Cannot find your active loan for this work.
sv: Det går inte att hitta ditt aktiva lån för detta verk.

source: You already fulfilled this loan as %(loan_delivery_mechanism)s, you can't also do it as %(requested_delivery_mechanism)s
sv: Du har redan genomfört detta lån som %(loan_delivery_mechanism)s, du kan inte också genomföra det som %(requested_delivery_mechanism)s

source: Integration error communicating with %(service_name)s
sv: Integrationsfel vid kommunikation med %(service_name)s

source: Lane does not exist
sv: Bandet finns inte

source: All Books
sv: Alla böcker

source: Internal signing secret for OAuth and SAML bearer tokens
sv: Krypteringskod för intern signering av bearer tokens för OAuth och SAML

source: Internal secret key for admin interface cookies
sv: Intern krypteringskod för administratörsgränssnittets kakor

source: Hostnames for web application access
sv: Värdnamn för åtkomst till webbapplikation

source: Only web applications from these hosts can access this circulation manager. This can be a single hostname (http://catalog.library.org) or a pipe-separated list of hostnames (http://catalog.library.org|https://beta.library.org). You must include the scheme part of the URI (http:// or https://). You can also set this to '*' to allow access from any host, but you must not do this in a production environment -- only during development.
sv: Endast webbapplikationer från dessa värdar kan använda denna lånehanterare. Detta kan vara ett värdnamn (http://catalog.library.org) eller en lista med värdnamn separerade med vertikalstreck (http://catalog.library.org|https://beta.library.org). Du måste inkludera schemat för URI (http:// or https://). Du kan också ställa in värdet till '*' för att ge åtkomst från vilken värd som helst, men du får inte göra detta i en produktionsmiljö -- bara vid utveckling.

source: Cache time for static images and JS and CSS files (in seconds)
sv: Cachetid för statiska bilder och JS- och CSS-filer (sekunder)

source: Cache time for authentication documents (in seconds)
sv: Cachetid för autentiseringsdokument (sekunder)

source: Custom Terms of Service link
sv: Länk till anpassade användarvillkor

source: If your inclusion in the SimplyE mobile app is governed by terms other than the default, put the URL to those terms in this link so that librarians will have access to them. This URL will be used for all libraries on this circulation manager.
sv: Om din användning av mobilappen SimplyE omfattas av andra villkor än standardvillkoren, ska du ange URL för dessa villkor i denna länk så att bibliotekarierna har tillgång till dem. Denna URL kommer att användas för alla bibliotek på denna utlåningshanterare.

source: Custom Terms of Service link text
sv: Länktext till anpassad användaravtal

source: Custom text for the Terms of Service link in the footer of these administrative interface pages. This is primarily useful if you're not connecting this circulation manager to the SimplyE mobile app. This text will be used for all libraries on this circulation manager.
sv: Anpassad text för användarvillkoren i sidfoten till dessa sidor för administratörsgränssnittet. Detta är nyttigt i första hand om du inte ansluter denna utlåningshanterare till mobilappen SimplyE. Denna text används i alla bibliotek i denna utlåningshanterare.

source: Scheduled announcements
sv: Schemalagda meddelanden

source: Announcements will be displayed to authenticated patrons.
sv: Meddelanden kommer att visas för autentiserade kunder.

source: I'm Under 13
sv: Jag är under 13 år

source: Read children's books
sv: Läs barnböcker

source: I'm 13 or Older
sv: Jag är 13 år eller äldre

source: See the full collection
sv: Se hela samlingen

source: ID of lane for patrons who are 13 or older
sv: Bandets ID för kunder som är 13 år eller äldre

source: ID of lane for patrons who are under 13
sv: Bandets ID för kunder som är under 13 år

source: Send patrons to the lane with this ID.
sv: Skicka kunder till bandet med denna ID.

source: E-kirjasto API environment
sv: E-bibliotekets API-miljö

source: Select what environment of E-kirjasto accounts should be used.
sv: Välj vilken miljö i e-biblioteket konton ska använda.

source: E-magazines environment
sv: Miljö för e-tidningar

source: Select what environment of e-magazines service should be used.
sv: Välj vilken servicemiljö för e-tidningar ska användas.

source: Delegate token expire time in seconds
sv: Förfallotid för fullmaktstoken i sekunder

source: Expire time for a delegate token to authorize in behalf of a ekirjasto token. This should be less than the expire time for ekirjasto token, so it can be refreshed.
sv: Tidsfrist inom vilken fullmaktstoken ska ge auktorisering för en e-bibliotekstoken. Den måste vara kortare än förfallotiden för e-bibliotekstoken så att den kan uppdateras.

source: Integrate an Enki collection.
sv: Integrera en Enki-samling

source: III Millenium Patron API
sv: API för III Millenium-kund

source: ODL feed URL
sv: URL för ODL-flöde

source: Library's API username
sv: Användarnamn för bibliotekets API

source: Library's API password
sv: Lösenord för biblitekets API

source: Default Reservation Period (in Days)
sv: Standard reservationstid (dagar)

source: The number of days a patron has to check out a book after a hold becomes available.
sv: Antalet dagar som kunden har tid att låna en reserverad bok efter att den blivit tillgänglig.

source: Passphrase hint
sv: Lösenordstips

source: Hint displayed to the user when opening an LCP protected publication.
sv: Tips som visas för användaren när denne öppnar en LCP-skyddad publikation.

source: Passphrase hint URL
sv: URL för lösenordstips

source: Hint URL available to the user when opening an LCP protected publication.
sv: URL för tipset blir tillgänglig för användaren när en LCP-skyddad publikation öppnas.

source: Passphrase encryption algorithm
sv: Lösenordets krypteringsalgoritm

source: Algorithm used for encrypting the passphrase.
sv: Den algoritm som används för att kryptera lösenordet.

source: Skipped license formats
sv: Licensformat som hoppats över

source: List of license formats that will NOT be imported into Circulation Manager.
sv: En lista över licensformat som INTE kommer att importeras till utlåningshanteraren.

source: Loan limit per patron
sv: Lånegräns per kund

source: The maximum number of books a patron can have loaned out at any given time.
sv: Det maximala antalet böcker en kund kan ha i lån på en gång.

source: Hold limit per patron
sv: Reservationsgräns per kund

source: The maximum number of books a patron can have on hold at any given time.
sv: Det maximala antalet böcker en kund kan ha reserverat på en gång.

source: Library's username or access key
sv: Bibliotekets användarnamn eller åtkomstnyckel

source: Library's password or secret key
sv: Bibliotekets lösenord eller krypteringsnyckel

source: Website ID
sv: Webbplatsens ID

source: Client Key
sv: Kundens nyckel

source: Client Secret
sv: Kundens lösenord

source: Server family
sv: Serverfamilj

source: Testing
sv: Testar

source: ILS Name
sv: ILS-namn

source: When multiple libraries share an Overdrive account, Overdrive uses a setting called 'ILS Name' to determine which ILS to check when validating a given patron.
sv: När flera bibliotek delar ett Overdrive-konto använder Overdrive en inställning som heter 'ILS Name' för att fastställa vilken ILS ska kontrolleras när en kund valideras.

source: Third-party service failed.
sv: Tredjeparts tjänst misslyckades.

source: The library could not complete your request because a third-party service has failed.
sv: Biblioteket kunde inte slutföra din begäran på grund av att en tredje parts tjänst misslyckades.

source: Feed should be been pre-cached.
sv: Flödet borde ha varit färdigt i cacheminnet.

source: This feed should have been pre-cached. It's too expensive to generate dynamically.
sv: Detta flöde borde ha varit färdigt i cacheminnet. Det är för dyrt att generera det dynamiskt.

source: Invalid credentials
sv: Ogiltiga identifieringsuppgifter

source: A valid library card barcode number and PIN are required.
sv: Streckkodsnummer och PIN-kod för ett giltigt bibliotekskort krävs.

source: Expired credentials.
sv: Identifieringsuppgifterna har löpt ut.

source: Your library card has expired. You need to renew it.
sv: Ditt bibliotekskort har löpt ut. Du måste förnya det.

source: Suspended credentials.
sv: Indragna identifieringsuppgifter.

source: Your library card has been suspended. Contact your branch library.
sv: Ditt bibliotekskort har upphävts. Kontakta ditt eget bibliotek.

source: No licenses.
sv: Inga licenser.

source: The library currently has no licenses for this book.
sv: Biblioteket har just nu inga licenser för denna bok.

source: No available license.
sv: Inga fria licenser.

source: All licenses for this book are loaned out.
sv: Alla licenser för denna bok är utlånade.

source: No acceptable format.
sv: Inget godtagbart format.

source: Could not deliver this book in an acceptable format.
sv: Kunde inte leverera denna bok i ett godtagbart format.

source: Already checked out
sv: Är redan utlånad

source: You have already checked out this book.
sv: Du har redan lånat denna bok.

source: You have reached your loan limit. You cannot borrow anything further until you return something.
sv: Du har nått din lånegräns. Du kan inte låna mera innan du lämnar något tillbaka.

source: You have reached your loan limit of %(limit)d. You cannot borrow anything further until you return something.
sv: Du har nått din lånegräns på %(limit)d. Du kan inte låna mera innan du lämnar något tillbaka.

source: Loan limit reached.
sv: Lånegräns nådd.

source: You have reached your hold limit. You cannot place another item on hold until you borrow something or remove a hold.
sv: Du har nått din reservationsgräns. Du kan inte göra fler reservationer innan du lånar något eller återkallar en reservation.

source: You have reached your hold limit of %(limit)d. You cannot place another item on hold until you borrow something or remove a hold.
sv: Du har nått din reservationsgräns på %(limit)d. Du kan inte göra fler reservationer innan du lånar något eller återkallar en reservation.

source: Limit reached.
sv: Gräns nådd.

source: Outstanding fines.
sv: Obetalda förseningsavgifter.

source: You must pay your outstanding fines before you can borrow more books.
sv: Du måste betala dina obetalda förseningsavgifter innan du kan låna flera böcker.

source: Could not issue loan.
sv: Det gick inte att låna ut verket.

source: Could not issue loan (reason unknown).
sv: Det gick inte att låna ut verket (okänd orsak).

source: Could not place hold.
sv: Det gick inte att reservera verket.

source: Could not place hold (reason unknown).
sv: Det gick inte att reservera verket (okänd orsak).

source: Could not renew loan.
sv: Det gick inte att förnya lånet.

source: Could not renew loan (reason unknown).
sv: Det gick inte att förnya lånet (okänd orsak).

source: No longer in collection.
sv: Ingår inte längre i samlingen.

source: This book was recently removed from the collection.
sv: Denna bok avlägsnades nyligen från samlingen.

source: No active loan.
sv: Inga aktiva lån.

source: You can't do this without first borrowing this book.
sv: Du kan inte göra detta utan att först låna denna bok.

source: No active hold.
sv: Inga aktiva reservationer.

source: You can't do this without first putting this book on hold.
sv: Du kan inte göra detta utan att först reservera denna bok.

source: No active loan or hold.
sv: Inget aktivt lån eller aktiv reservation.

source: You can't do this without first borrowing this book or putting it on hold.
sv: Du kan inte göra detta utan att först låna eller reservera denna bok.

source: Loan not found.
sv: Kunde inte hitta lånet.

source: You don't have a loan with the provided id.
sv: Du har inget lån med detta ID.

source: Hold not found.
sv: Kunde inte hitta reservation.

source: You don't have a hold with the provided id.
sv: Du har ingen reservation med detta ID.

source: Could not mirror local state to remote.
sv: Det gick inte att spegla det lokala tillståndet till fjärrtillståndet.

source: Could not convince a third party to accept the change you made. It's likely to show up again soon.
sv: Det gick inte att övertala en tredje part att godkänna din ändring. Den dyker sannolikt upp på nytt snart.

source: No such lane.
sv: Finns inget sådant band.

source: You asked for a nonexistent lane.
sv: Du begärde ett band som inte finns.

source: No such list.
sv: Det finns ingen sådan lista.

source: You asked for a nonexistent list.
sv: Du begärde en lista som inte finns.

source: Cannot delete list.
sv: Det går inte att radera listan.

source: It is not possible to delete a shared list.
sv: Det är inte möjligt att radera en delad lista.

source: No such collection.
sv: Det finns ingen sådan samling.

source: You asked for a nonexistent collection.
sv: Du begärde en samling som inte finns.

source: Forbidden by policy.
sv: Förbjudet enligt policyn.

source: Library policy prevents us from carrying out your request.
sv: Bibliotekets policy förhindrar oss från att utföra din begäran.

source: Library policy considers this title inappropriate for your patron type.
sv: Bibliotekets policy anser att detta verk är olämpligt för din kundtyp.

source: Could not fulfill loan.
sv: Det gick inte att fullborda lånet.

source: Delivery mechanism conflict.
sv: Konflikt med leveransmekanismen.

source: The delivery mechanism for this book has been locked in and can't be changed.
sv: Leveransmekanismen för denna bok är låst och kan inte ändras.

source: Unsupported delivery mechanism.
sv: Leveransmekanismen stöds inte.

source: You selected a delivery mechanism that's not supported by this book.
sv: Du valde en leveransmekanism som inte stöds av denna bok.

source: Could not release hold.
sv: Det gick inte att annullera reservationen.

source: Unknown SAML provider.
sv: Okänd SAML-leverantör.

source: The specified SAML provider name isn't one of the known providers.
sv: Denna SAML-leverantör är inte en känd leverantör.

source: Ekirjasto provider not configured.
sv: E-bibliotekets leverantör har inte konfigurerats.

source: Ekirjasto provider was not configured for the library
sv: E-bibliotekets leverantör är inte konfigurerad för biblioteket

source: Ekirjasto remote method not supported.
sv: Fjärranvändning av E-biblioteket stöds inte.

source: Method for a remote call not supported.
sv: Metoden för fjärranrop stöds inte.

source: Invalid SAML bearer token.
sv: Ogiltigt SAML-bearertoken

source: The provided SAML bearer token couldn't be verified.
sv: SAML-bearertoken kunde inte verifieras.

source: Invalid delegate token for ekirjasto authentication provider.
sv: Ogiltigt fullmaktstoken för e-bibliotekets autentiseringsleverantör.

source: The provided delegate token couldn't be verified for ekirjasto authentication provider or it is expired.
sv: Fullmaktstoken kunde inte verifieras för e-bibliotekets autentiseringsleverantör eller så har det gått ut.

source: Invalid ekirjasto token for ekirjasto API.
sv: E-bibliotekets token är ogiltigt för e-bibliotekets API.

source: The provided ekirjasto token couldn't be verified for ekirjasto API.
sv: E-bibliotekets token kunde inte verifieras för e-bibliotekets API.

source: Missing permanent id
sv: TRANSLATE

source: Value for permanent_id is missing in remote user info.
sv: TRANSLATE

source: Authentication with ekirjasto API failed.
sv: Autentisering med e-bibliotekets API misslyckades.

source: Authentication with ekirjasto API failed, for unknown reason.
sv: Autentisering med e-bibliotekets API misslyckades. Orsak okänd.

source: Call to ekirjasto API failed.
sv: Anrop till E-bibliotekets API misslyckades.

source: Call to ekirjasto API failed, for unknown reason.
sv: Anrop till E-bibliotekets API misslyckades av okänd orsak.

source: Unsupported authentication mechanism.
sv: Autentiseringsmekanismen stöds inte.

source: The specified authentication mechanism isn't supported.
sv: Den specificerade autentiseringsmekanismen stöds inte.

source: Invalid analytics event type.
sv: Ogiltig typ för analyshändelse.

source: The analytics event must be a supported type.
sv: Analyshändelsen måste vara av en typ som stöds.

source: Invalid annotation motivation.
sv: Ogiltig grund för annotation.

source: The annotation must have a supported motivation.
sv: Annotationen måste ha en grund som stöds.

source: Invalid annotation target.
sv: Ogiltigt mål för annotationen.

source: The annotation target must be a work in your current loans.
sv: Målet för annotationen måste vara ett verk bland dina nuvarande lån.

source: Invalid annotation format.
sv: Ogiltigt annotationsformat.

source: The annotation could not be parsed as JSON-LD.
sv: Annotationen kunde inte parseras som en JSON-LD.

source: No annotation.
sv: Inga annotationer.

source: The annotation you requested does not exist.
sv: Annotationen som du begärde finns inte.

source: Library not found.
sv: Kunde inte hitta bibliotek.

source: No library with the requested name on this server.
sv: Det finns inget bibliotek med detta namn på denna server.

source: Wrong library
sv: Fel bibliotek

source: You are not a patron of the selected library.
sv: Du är inte kund hos det valda biblioteket.

source: Invalid loan for ODL notification
sv: Ogiltigt lån för ODL-meddelande

source: The ODL notification is for a loan that's not from an ODL collection.
sv: ODL-meddelandet är avsett för lån som inte kommer från en ODL-samling.

source: Invalid registration
sv: Ogiltig registrering

source: You did not submit enough information to register with the collection.
sv: Du uppgav inte tillräckligt med information för att registrera dig i samlingen.

source: Decryption error
sv: Dekrypteringsfel

source: Failed to decrypt a shared secret retrieved from another computer.
sv: Det gick inte att dekryptera en delad kryptering som hämtats från en annan dator.

source: Device token not found
sv: Kunde inte hitta enhetstoken

source: Patron does not have a device registered with this token.
sv: Kunden har ingen enhet som registrerats med detta token.

source: Device token already exists
sv: Enhetstoken finns redan

source: A device token with the same token already exists.
sv: Det finns redan ett enhetstoken med samma token.

source: Device token type invalid
sv: Ogiltig typ av enhetstoken

source: The token type provided is not valid.
sv: Denna typ av token är ogiltig.

source: Access token expired
sv: Åtkomsttoken har löpt ut

source: The patron authentication access token has expired.
sv: Åtkomsttoken för autentisering av kund har löpt ut.

source: Access token invalid
sv: Ogiltigt åtkomsttoken

source: The patron authentication access token is invalid.
sv: Åtkomsttoken för autentisering av kund har löpt ut.

source: Access token not possible
sv: Åtkomsttoken inte möjligt

source: The patron authentication access token is not possible for this type of authentication.
sv: Åtkomsttoken för autentisering av kund är inte möjligt för denna typ av autentisering.

source: Loan deleted locally but remote failed.
sv: TRANSLATE

source: Patron has not yet been approved
sv: Kunden har ännu inte godkänts

source: Patron membership has expired
sv: Kundens medlemskap har löpt ut

source: Patron has been blocked.
sv: Kunden har blockerats.
