Repository: NatLibFi/ekirjasto-circulation
Catalog: translations/*/LC_MESSAGES/core.po
Languages: fi, sv

source: Debug
fi: Virheenkorjaus
sv: Felsökning

source: Info
fi: Tiedot
sv: Information

source: Warn
fi: Varoitus
sv: Varna

source: Error
fi: Virhe
sv: Fel

source: Base url of the application
fi: Sovelluksen perus-url
sv: Appens grundläggande URL

source: Log Level
fi: Lokitaso
sv: Loggnivå

source: Application name
fi: Sovelluksen nimi
sv: Appens namn

source: Log messages originating from this application will be tagged with this name. If you run multiple instances, giving each one a different application name will help you determine which instance is having problems.
fi: Tästä sovelluksesta peräisin olevat lokiviestit merkitään tällä nimellä. Jos suoritat useita esiintymiä, voit antaa kullekin eri sovelluksen nimen, jotta sinun on helpompi määrittää, missä esiintymässä on ongelmia.
sv: Loggmeddelanden som kommer från denna app taggas med detta namn. Om du kör flera instanser är det lättare för dig att fastställa vilken instans det är som har problem om du ger varje instans ett eget appnamn.

source: Database Log Level
fi: Tietokantalokitaso
sv: Databasens loggnivå

source: Database logs are extremely verbose, so unless you're diagnosing a database-related problem, it's a good idea to set a higher log level for database messages.
fi: Tietokantalokit ovat erittäin monisanaisia, joten ellei kyseessä ole tietokantaan liittyvän ongelman määrittäminen, tietokantaviesteille kannattaa asettaa korkeampi lokitaso.
sv: Databasens logg är extremt omständliga så om du inte diagnosticerar ett databasrelaterat problem är det en bra idé att ställa in en högre loggnivå för databasmeddelanden.

source: Excluded audiobook sources
fi: Poissuljetut äänikirjalähteet
sv: Exkluderade ljudbokskällor

source: Audiobooks from these data sources will be hidden from the collection, even if they would otherwise show up as available.
fi: Näistä tietolähteistä peräisin olevat äänikirjat piilotetaan kokoelmasta, vaikka ne muuten näkyisivät saatavilla olevina.
sv: Ljudböcker från dessa datakällor kommer att döljas för samlingen även om de annars skulle visas som tillgängliga.

source: Cleanup old measurement data
fi: Vanhojen mittaustietojen puhdistus
sv: Rensa gamla mätdata

source: If this settings is 'true' old book measurement data will be cleaned out of the database. Some sites may want to keep this data for later analysis.
fi: Jos tämän asetuksen arvona on "tosi", kirjan vanhat mittaustiedot poistetaan tietokannasta. Jotkut sivustot saattavat haluta säilyttää nämä tiedot myöhempää analysointia varten.
sv: Om denna inställning är "Sant" kommer gamla mätdata för boken att rensas från databasen. Vissa webbplatser kan vilja behålla dessa data för senare analys.

source: Push notifications status
fi: Push-ilmoitusten tila
sv: Status för push-meddelanden

source: If this settings is 'true' push notification jobs will run as scheduled, and attempt to notify patrons via mobile push notifications.
fi: Jos tämän asetuksen arvona on "tosi", push-ilmoitustehtävät suoritetaan aikataulun mukaisesti, ja asiakkaille yritetään ilmoittaa mobiililaitteille tulevien push-ilmoitusten kautta.
sv: Om denna inställning är "Sant" kommer jobb med push-meddelande att köras enligt schema och försök kommer att göras att meddela kunder med push-meddelanden via mobilen.

source: True
fi: Tosi
sv: Sant

source: False
fi: Epätosi
sv: Falskt

source: Connection retry limit
fi: Yhteyden uudelleen yrittämisen raja
sv: Gräns för att ansluta på nytt

source: The maximum number of times to retry a request for certain connection-related errors.
fi: Kuinka monta kertaa pyyntöä voi enintään yrittää uudelleen tietyissä yhteyteen liittyvissä virheissä.
sv: Det maximala antalet gånger du kan försöka begära vissa anslutningsrelaterade fel på nytt.

source: All
fi: Kaikki
sv: Alla

source: eBooks
fi: E-kirjat
sv: E-böcker

source: Audiobooks
fi: Äänikirjat
sv: Ljudböcker

source: Invalid page key: %(key)s
fi: Virheellinen sivuavain: %(key)s
sv: Ogiltig sidnyckel: %(key)s

source: Sort by
fi: Lajitteluperuste
sv: Sortera efter

source: Availability
fi: Saatavuus
sv: Tillgänglighet

source: Collection
fi: Kokoelma
sv: Samling

source: Distributor
fi: Jakelija
sv: Distributör

source: Collection Name
fi: Kokoelman nimi
sv: Samlingens namn

source: Language
fi: Kieli
sv: Språk

source: Allow patrons to sort by
fi: Salli asiakkaiden lajitella seuraavan mukaan
sv: Tillåt kunder sortera efter

source: Allow patrons to filter availability to
fi: Salli asiakkaiden suodattaa saatavuus
sv: Tillåt kunder sortera tillgängligheten

source: Allow patrons to filter collection to
fi: Salli asiakkaiden suodattaa kokoelma
sv: Tillåt kunder sortera samlingen

source: Allow patrons to filter by distributor
fi: Salli asiakkaiden suodattaa jakelijan mukaan
sv: Tillåt kunder sortera efter distributör

source: Allow patrons to filter by collection name
fi: Salli asiakkaiden suodattaa kokoelman nimen mukaan
sv: Tillåt kunder sortera efter samlingens namn

source: Allow patrons to filter by language
fi: Salli asiakkaiden suodattaa kielen mukaan
sv: Tillåt kunder att filtrera enligt språk

source: Title
fi: Nimi
sv: Titel

source: Author
fi: Tekijä
sv: Författare

source: Last Update
fi: Viimeisin päivitys
sv: Senaste uppdatering

source: Recently Added
fi: Äskettäin lisätty
sv: Nyligen tillagd

source: Series Position
fi: Sarjan sijainti
sv: Seriens position

source: Work ID
fi: Työn tunnus
sv: Verkets ID

source: Available now
fi: Saatavilla nyt
sv: Tillgänglig nu

source: Yours to keep
fi: Voit pitää tämän
sv: Du kan behålla den

source: Everything
fi: Kaikki
sv: Allt

source: Popular Books
fi: Suositut kirjat
sv: Populära böcker

source: I don't know how to order a feed by '%(order)s'
fi: En tiedä, miten syöte järjestetään seuraavan mukaan: %(order)s
sv: Jag vet inte hur man sortera ett flöde efter '%(order)s'

source: I don't understand the availability term '%(availability)s'
fi: En ymmärrä saatavuustermiä %(availability)s
sv: Jag förstår inte tillgänglighetstiden '%(availability)s'

source: I don't understand what '%(collection)s' refers to.
fi: En ymmärrä, mitä %(collection)s tarkoittaa.
sv: Jag förstår inte vad '%(collection)s' hänför sig till.

source: I don't understand which distributor '%(distributor)s' refers to.
fi: En ymmärrä, mihin jakelijaan %(distributor)s viittaa.
sv: Jag förstår inte vilken distributör '%(distributor)s' hänför sig till.

source: I don't understand which collection '%(collection_name)s' refers to.
fi: En ymmärrä, mihin kokoelmaan %(collection_name)s viittaa.
sv: Jag förstår inte vilken samling '%(collection_name)s' hänför sig till.

source: Invalid page size: %(size)s
fi: Virheellinen sivukoko: %(size)s
sv: Ogiltig sidstorlek: %(size)s

source: Invalid offset: %(offset)s
fi: Virheellinen offset: %(offset)s
sv: Ogiltigt offset: %(offset)s

source: All %(worklist)s
fi: Kaikki %(worklist)s
sv: Alla %(worklist)s

source: Custom accept header
fi: Mukautettu hyväksymisen otsikko
sv: Anpassad accept header

source: Some servers expect an accept header to decide which file to send. You can use */* if the server doesn't expect anything.
fi: Jotkin palvelimet olettavat, että hyväksymisen otsikko päättää, mikä tiedosto lähetetään. Voit käyttää merkkejä */*, jos palvelin ei oleta mitään.
sv: Vissa servrar förväntar att accept header avgör vilken fil som ska sändas. Du kan använda */* om servern inte antar något.

source: List of identifiers that will be skipped
fi: Luettelo ohitettavista tunnisteista
sv: Lista över idenfierare som hoppas över

source: Circulation Manager will not be importing publications with identifiers having one of the selected types.
fi: Lainauksen hallinta ei tuo julkaisuja, joiden tunnisteilla on jokin valituista tyypeistä.
sv: Utlåningshanteraren kommer inte att importera publikationer med identifierare av en av de valda typerna.

source: Import books from a publicly-accessible OPDS 2.0 feed.
fi: Tuo kirjoja julkisesti saatavilla olevasta OPDS 2.0 -syötteestä.
sv: Importera böcker från ett offentligt tillgängligt OPDS 2.0-flöde.

source: URL
fi: URL-osoite

source: Data source name
fi: Tietolähteen nimi
sv: Datakällans namn

source: Default audience
fi: Oletusyleisö
sv: Standard läsarkrets

source: If the vendor does not specify the target audience for their books, assume the books have this target audience.
fi: Jos toimittaja ei määritä kirjojensa kohdeyleisöä, oleta, että kirjojen kohdeyleisö on tämä.
sv: Om leverantören inte anger en läsarkrets dess böcker är avsedd för, anta att böckerna är avsedda för denna läsarkrets.

source: No default audience
fi: Ei oletusyleisöä
sv: Ingen standard läsarkrets

source: Username
fi: Käyttäjänimi
sv: Användarnamn

source: If HTTP Basic authentication is required to access the OPDS feed (it usually isn't), enter the username here.
fi: Jos HTTP Basic -tunnistus vaaditaan OPDS-syötteen käyttämiseksi (yleensä sitä ei vaadita), kirjoita käyttäjänimi tähän.
sv: Om HTTP Basic-autentisering krävs för att få åtkomst till OPDS-flödet (vanligtvis inte), ange användarnamnet här.

source: Password
fi: Salasana
sv: Lösenord

source: If HTTP Basic authentication is required to access the OPDS feed (it usually isn't), enter the password here.
fi: Jos HTTP Basic -tunnistus vaaditaan OPDS-syötteen käyttämiseksi (yleensä sitä ei vaadita), kirjoita salasana tähän.
sv: Om HTTP Basic-autentisering krävs för att få åtkomst till OPDS-flödet (vanligtvis inte), ange lösenordet här.

source: Identifer
fi: Tunniste
sv: Identifierare

source: Which book identifier to use as ID.
fi: Mitä kirjan tunnistetta käytetään tunnuksena.
sv: Vilken av bokens identifierare ska användas som ID.

source: Import books from a publicly-accessible OPDS feed.
fi: Tuo kirjoja julkisesti saatavilla olevasta OPDS-syötteestä.
sv: Importera böcker från ett offentligt tillgängligt OPDS-flöde.

source: Invalid input.
fi: Virheellinen syöte.
sv: Ogiltiga indata.

source: You provided invalid or unrecognized input.
fi: Annoit virheellisen tai tunnistamattoman syötteen.
sv: Du matade in ogiltiga eller okända indata.

source: Invalid credentials
fi: Virheelliset kirjautumistiedot
sv: Ogiltiga identifieringsuppgifter

source: Valid credentials are required.
fi: Kelvolliset kirjautumistiedot vaaditaan.
sv: Giltiga identifieringsuppgifter krävs.

source: Method not allowed
fi: Menetelmä ei ole sallittu
sv: Otillåten metod

source: The HTTP method you used is not allowed on this resource.
fi: Käyttämäsi HTTP-menetelmä ei ole sallittu tässä resurssissa.
sv: HTTP-metoden du använde tillåts inte för denna resurs.

source: Unsupported media type
fi: Mediatyyppi, jota ei tueta
sv: Typ av medium som inte stöds

source: You submitted an unsupported media type.
fi: Annoit mediatyypin, jota ei tueta.
sv: Du angav ett medium som inte stöds.

source: Payload too large
fi: Liian suuri kuormitus
sv: För stor belastning

source: You submitted a document that was too large.
fi: Annoit liian suuren dokumentin.
sv: Du lämnade in ett dokument som var för stort.

source: Internal server error.
fi: Sisäinen palvelinvirhe.
sv: Internt serverfel.

source: Internal server error
fi: Sisäinen palvelinvirhe
sv: Internt serverfel

source: Invalid URN
fi: Virheellinen URN
sv: Ogiltig URN

source: Could not parse identifier.
fi: Tunnistetta ei voitu jäsentää.
sv: Kunde inte parsera identifieraren.

source: Unrecognized data source.
fi: Tunnistamaton tietolähde.
sv: Okänd datakälla.

source: I don't know anything about that data source.
fi: En tiedä mitään kyseisestä tietolähteestä.
sv: Jag vet inget om denna datakälla.

source: Third-party service failed.
fi: Kolmannen osapuolen palvelu epäonnistui.
sv: Tredjeparts tjänst misslyckades.

source: A third-party service has failed.
fi: Kolmannen osapuolen palvelu on epäonnistunut.
sv: En tredjeparts tjänst har misslyckats.

source: Invalid reset password token
fi: Virheellinen salasanan nollauksen tunnus
sv: Ogiltigt token för återställande av lösenord

source: Provided reset password token is not valid.
fi: Annettu salasanan nollauksen tunnus ei kelpaa.
sv: Token som gavs för att återställa lösenordet är ogiltigt.

source: Profile document is not a JSON object: %r.
fi: Profiilidokumentti ei ole JSON-objekti: %r.
sv: Profildokumentet är inte ett JSON-objekt: %r.

source: Could not convert profile document to JSON: %r.
fi: Profiilidokumenttia ei voitu muuttaa JSON:ksi: %r.
sv: Kunde inte konvertera profildokumentet till JSON: %r.

source: Expected %s
fi: Odotettu %s
sv: Förväntade %s

source: Submitted profile document was not valid JSON.
fi: Annettu profiilidokumentti ei ollut kelvollinen JSON.
sv: Det inlämnade profildokumentet var inte ett giltigt JSON.

source: Submitted profile document was not a JSON object.
fi: Annettu profiilidokumentti ei ollut JSON-objekti.
sv: Det inlämnade profildokumentet var inte ett giltigt JSON-objekt.

source: "%s" is not a writable setting.
fi: %s ei ole kirjoitettava asetus.
sv: "%s" är inte en skrivbar inställning.

source: Adult
fi: Aikuiset
sv: Vuxen

source: Adults Only
fi: Vain aikuiset
sv: Bara vuxen

source: Young Adult
fi: Nuoret
sv: Ungdomar

source: Children
fi: Lapset
sv: Barn

source: All Ages
fi: Kaikki ikäryhmät
sv: Alla åldrar

source: Fiction
fi: Kaunokirjallisuus
sv: Skönlitteratur

source: Nonfiction
fi: Tietokirjallisuus
sv: Facklitteratur

source: Adventure
fi: Seikkailu
sv: Äventyr

source: Animal Stories
fi: Eläintarinat
sv: Djurberättelser

source: Horse Stories
fi: Hevostarinat
sv: Hästberättelser

source: Pet Stories
fi: Lemmikkitarinat
sv: Sällskapsdjursberättelser

source: Difficult Topics
fi: Haastavat aiheet
sv: Svåra ämnen

source: Bullying
fi: Kiusaaminen
sv: Mobbning

source: Death
fi: Kuolema
sv: Döden

source: Multicultural Stories
fi: Monikulttuurisuus
sv: Mångkulturella berättelser

source: Disabilities
fi: Vammat
sv: Funktionsnedsättningar

source: War
fi: Sota
sv: Krig

source: Drugs
fi: Huumeet
sv: Droger

source: Eating Disorders & Self-Image
fi: Syömishäiriöt ja kehonkuva
sv: Ätstörningar och Självbild

source: Mental Health
fi: Mielenterveys
sv: Psykisk hälsa

source: Classics
fi: Klassikot
sv: Klassiker

source: Comics & Graphic Novels
fi: Sarjakuvalehdet ja -romaanit
sv: Serier och grafiska romaner

source: Diary Stories
fi: Päiväkirjatarinat
sv: Dagboksberättelser

source: Drama
fi: Draama

source: Erotica
fi: Erotiikka
sv: Erotik

source: Family Stories
fi: Perhetarinat
sv: Familjeberättelser

source: Festivities & Holidays
fi: Juhlat
sv: Fester och semester

source: Easter Stories
fi: Pääsiäistarinat
sv: Påskberättelser

source: Christmas Stories
fi: Joulutarinat
sv: Julberättelser

source: Halloween Stories
fi: Halloween-tarinat
sv: Halloween berättelser

source: Fantasy
fi: Fantasia
sv: Fantasi

source: Epic Fantasy
fi: Eeppinen fantasia
sv: Episk fantasy

source: Historical Fantasy
fi: Historiallinen fantasia
sv: Historisk fantasy

source: Urban Fantasy
fi: Urbaani fantasia

source: Folklore Stories
fi: Kansanperinnetarinat
sv: Folksagor

source: Growing Up
fi: Aikuistuminen
sv: Växa upp

source: Historical Fiction
fi: Historiallinen kaunokirjallisuus
sv: Historisk fiktion

source: Horror
fi: Kauhu
sv: Skräcklitteratur

source: Gothic Horror
fi: Goottilainen kauhu
sv: Gotisk skräcklitteratur

source: Ghost Stories
fi: Kummitustarinat
sv: Spökhistorier

source: Vampires
fi: Vampyyrit
sv: Vampyrer

source: Werewolves
fi: Ihmissudet
sv: Varulvar

source: Occult Horror
fi: Yliluonnollinen kauhu
sv: Ockult skräck

source: Humor
fi: Huumori

source: Humorous Fiction
fi: Humoristinen kaunokirjallisuus
sv: Humoristisk skönlitteratur

source: General Fiction
fi: Yleinen kaunokirjallisuus
sv: Allmän skönlitteratur

source: LGBTQ Fiction
fi: HLBTQ+
sv: HBTQ skönlitteratur

source: Mystery
fi: Dekkarit
sv: Mystik

source: Crime & Detective Stories
fi: Rikos- ja salapoliisiromaanit
sv: Deckare & Kriminalromaner

source: Hard-Boiled Mystery
fi: Kovaksikeitetyt dekkarit
sv: Hårdkokta deckare

source: Police Procedural
fi: Poliisiromaanit
sv: Polisdeckare

source: Cozy Mystery
fi: Hyvän mielen dekkarit
sv: Mysdeckare

source: Historical Mystery
fi: Historialliset dekkarit
sv: Historiska deckare

source: Paranormal Mystery
fi: Yliluonnolliset dekkarit
sv: Paranormala deckare

source: Women Detectives
fi: Naisetsivät
sv: Kvinnliga detektiver

source: Poetry
fi: Runous
sv: Poesi

source: Religious Fiction
fi: Uskonnollinen kaunokirjallisuus
sv: Religiös skönlitteratur

source: Romance
fi: Romantiikka
sv: Romantik

source: Contemporary Romance
fi: Nykyajan romantiikka
sv: Samtida romantik

source: Gothic Romance
fi: Goottilainen romantiikka
sv: Gotisk romantik

source: Historical Romance
fi: Historiallinen romantiikka
sv: Historisk romantik

source: Paranormal Romance
fi: Yliluonnollinen romantiikka
sv: Paranormal romantik

source: Western Romance
fi: Romanttinen western
sv: Västerländsk romantik

source: Romantic Suspense
fi: Romanttinen jännitys
sv: Romantisk spänning

source: School & Study
fi: Koulu ja opiskelu
sv: Skola och studier

source: Science Fiction
fi: Scifi

source: Dystopian SF
fi: Dystooppinen scifi
sv: Dystopisk science fiction

source: Space Opera
fi: Avaruusooppera
sv: Rymdopera

source: Cyberpunk
fi: Kyberpunk

source: Military SF
fi: Sotilaallinen scifi
sv: Militär science fiction

source: Alternative History
fi: Vaihtoehtohistoria
sv: Alternativ historia

source: Romantic SF
fi: Romanttinen scifi
sv: Romantisk science fiction

source: Media Tie-in SF
fi: TV:stä tuttu scifi
sv: Science fiction från TV

source: Short Stories
fi: Novellit
sv: Noveller

source: Sports Stories
fi: Urheilutarinat
sv: Sportberättelser

source: Football Stories
fi: Jalkapallotarinat
sv: Fotbollsberättelser

source: Hockey Stories
fi: Jääkiekkotarinat
sv: Ishockeyberättelser

source: Dance Stories
fi: Tanssitarinat
sv: Dansberättelser

source: Riding Stories
fi: Ratsastustarinat
sv: Ridberättelser

source: Skating Stories
fi: Luistelutarinat

source: Superheroes
fi: Supersankarit
sv: Superhjältar

source: Suspense/Thriller
fi: Jännitys
sv: Rysare/Thriller

source: Historical Thriller
fi: Historiallinen jännitys
sv: Historisk thriller

source: Espionage
fi: Vakoilu
sv: Spionromaner

source: Supernatural Thriller
fi: Yliluonnollinen jännitys
sv: Övernaturlig thriller

source: Medical Thriller
fi: Lääketieteellinen jännitys
sv: Medicinsk thriller

source: Political Thriller
fi: Poliittinen jännitys
sv: Politisk thriller

source: Psychological Thriller
fi: Psykologinen jännitys
sv: Psykologisk thriller

source: Technothriller
fi: Teknotrillerit
sv: Teknothriller

source: Legal Thriller
fi: Oikeudenkäyntijännitys
sv: Rättegångsthriller

source: Military Thriller
fi: Sotilaallinen jännitys
sv: Militär thriller

source: Urban Fiction
fi: Urbaani fiktio

source: Vehicles & Technology
fi: Kulkuneuvot ja tekniikka
sv: Fordon och Teknologi

source: Cars
fi: Autot
sv: Bilar

source: Trains
fi: Junat
sv: Tåg

source: Airplanes
fi: Lentokoneet
sv: Flygplan

source: Westerns
fi: Westernit
sv: Västernskildringar

source: Animals
fi: Eläimet
sv: Djur

source: Horses & Riding
fi: Hevoset ja ratsastus
sv: Hästar och ridning

source: Pet Animals
fi: Lemmikit
sv: Sällskapsdjur

source: Dinosaurs
fi: Dinosaurukset
sv: Dinosaurier

source: Art & Culture
fi: Taide ja kulttuuri
sv: Konst och kultur

source: Film & TV
fi: Elokuvat ja televisio
sv: Film och TV

source: Music
fi: Musiikki
sv: Musik

source: Performing Arts
fi: Esittävät taiteet
sv: Scenkonst

source: Drawing
fi: Piirtäminen
sv: Teckning

source: Architecture
fi: Arkkitehtuuri
sv: Arkitektur

source: Art
fi: Taide
sv: Konst

source: Art Criticism & Theory
fi: Taidekritiikki ja taiteen teoria
sv: Konstkritik och konstteori

source: Art History
fi: Taidehistoria
sv: Konsthistoria

source: Design
fi: Muotoilu
sv: Formgivning

source: Fashion
fi: Muoti
sv: Mode

source: Photography
fi: Valokuvaus
sv: Fotografering

source: Biography & Memoir
fi: Elämäkerrat ja muistelmat
sv: Biografier och memoarer

source: Athletes
fi: Urheilijat
sv: Idrottare

source: Musicians
fi: Muusikot
sv: Musiker

source: Careers
fi: Ammatinvalinta
sv: Karriärer

source: Computers & Digital Skills
fi: Tietokoneet ja digitaidot
sv: Datorer och digtala färdigheter

source: Cooking & Baking
fi: Ruoka ja leipominen
sv: Matlagning och bakning

source: Climate & Sustainability
fi: Ilmasto ja kestävyys
sv: Klimat och hållbarhet

source: Continents & Countries
fi: Maanosat ja valtiot
sv: Kontinenter och länder

source: Diversity & Multicultural
fi: Sateenkaari ja monilttuurisuus
sv: Mångfald och flerkulturalism

source: Education
fi: Koulutus
sv: Utbildning

source: Encyclopedias
fi: Yleiset tietosanakirjat
sv: Encyklodepier

source: Family
fi: Perhe
sv: Familj

source: Fashion & Looks
fi: Muoti ja ulkonäkö
sv: Mode och utseende

source: Folklore
fi: Kansanperinne

source: Games
fi: Pelit
sv: Spel

source: Video Games
fi: Videopelit
sv: Videospel

source: Board Games & Strategic Games
fi: Lauta- ja strategiapelit
sv: Bordsspel och strategiska spel

source: Food & Health
fi: Ruoka ja terveys
sv: Mat och hälsa

source: Bartending & Cocktails
fi: Cocktailit, valmistus ja tarjoilu
sv: Bartendning och cocktails

source: Cooking
fi: Ruoanlaitto
sv: Matlagning

source: Health & Diet
fi: Terveys ja ruokavaliot
sv: Hälsa och dieter

source: Vegetarian & Vegan
fi: Kasvissyönti ja veganismi
sv: Vegetariskt och vegant

source: General Nonfiction
fi: Yleinen tietokirjallisuus
sv: Allmän facklitteratur

source: Health & Wellness
fi: Ihminen ja terveys
sv: Hälsa och välmående

source: History
fi: Historia
sv: Historia

source: African History
fi: Afrikan historia
sv: Afrikansk historia

source: Ancient History
fi: Muinaishistoria
sv: Fornhistoria

source: Asian History
fi: Aasian historia
sv: Asiatisk historia

source: Civil War History
fi: Sisällissodan historia
sv: Inbördeskrigs historia

source: European History
fi: Euroopan historia
sv: Europeisk historia

source: Latin American History
fi: Latinalaisen Amerikan historia
sv: Latinamerikansk historia

source: Medieval History
fi: Keskiajan historia
sv: Medeltids historia

source: Middle East History
fi: Lähi-idän historia
sv: Mellanösterns historia

source: Military History
fi: Sotahistoria
sv: Militär historia

source: Modern History
fi: Uuden ajan historia
sv: Modern historia

source: Renaissance & Early Modern History
fi: Renessanssi ja uuden ajan alun historia
sv: Renässansen och tidigmodern historia

source: United States History
fi: Yhdysvaltojen historia
sv: USA:s historia

source: World History
fi: Maailmanhistoria
sv: Världshistoria

source: Hobbies & Home
fi: Harrastukset ja koti
sv: Hobbyer och hem

source: Antiques & Collectibles
fi: Antiikki ja keräilyesineet
sv: Antikviteter och samlarföremål

source: Crafts & Hobbies
fi: Käsityöt ja harrastukset
sv: Handarbete och hobbyer

source: Gardening
fi: Puutarhanhoito
sv: Trädgårdsskötsel

source: Games & Activities
fi: Pelit
sv: Spel och aktiviteter

source: House & Home
fi: Talo ja koti
sv: Hus och hem

source: Pets
fi: Lemmikkieläimet
sv: Sällskapsdjur

source: Holidays & Celebrations
fi: Juhlat
sv: Semester och fester

source: Christmas
fi: Joulu
sv: Jul

source: Birthdays
fi: Syntymäpäivät
sv: Födelsedagar

source: Humorous Nonfiction
fi: Humoristinen tietokirjallisuus
sv: Humoristisk facklitteratur

source: Life Strategies
fi: Elämänhallinta
sv: Livsstrategier

source: Literary Criticism
fi: Kirjallisuustiede
sv: Litteraturkritik

source: Machinery & Equipment
fi: Koneet ja laitteet
sv: Maskiner och utrustning

source: Robots
fi: Robotit
sv: Robotar

source: Vehicles
fi: Kulkuneuvot
sv: Fordon

source: Parenting & Family
fi: Vanhemmuus ja perhe
sv: Föräldraskap och familj

source: Family & Relationships
fi: Perhe ja ihmissuhteet
sv: Familj och relationer

source: Parenting
fi: Vanhemmuus
sv: Föräldraskap

source: Periodicals
fi: Aikakauslehdet
sv: Tidsskrifter
