Repository: NatLibFi/ekirjasto-circulation
Catalog: translations/*/LC_MESSAGES/core.po
Languages: fi, sv

source: Personal Finance & Business
fi: Oma talous ja liiketoiminta
sv: Personlig ekonomi och företagande

source: Business
fi: Liiketoiminta
sv: Företagande

source: Economics
fi: Taloustiede
sv: Ekonomi

source: Management & Leadership
fi: Johtaminen ja johtajuus
sv: Förvaltning och ledarskap

source: Personal Finance & Investing
fi: Oma talous ja sijoittaminen
sv: Personlig ekonomi och investering

source: Real Estate
fi: Kiinteistöt
sv: Fastigheter

source: Philosophy
fi: Filosofia
sv: Filosofi

source: Play & Hobbies
fi: Leikki ja harrastukset
sv: Lek och hobbyer

source: Toys
fi: Lelut
sv: Leksaker

source: Crafts
fi: Askartelu
sv: Hantverk

source: Camping
fi: Retkeily

source: Political Science
fi: Valtiotiede
sv: Statsvetenskap

source: Reference & Study Aids
fi: Tiede- ja tutkimuskirjallisuus
sv: Faktaböcker och studiehjälp

source: Dictionaries
fi: Sanakirjat
sv: Ordböcker

source: Foreign Language Study
fi: Vieraiden kielten opiskelu
sv: Studier i främmande språk

source: Law
fi: Laki
sv: Juridik

source: Study Aids
fi: Tutkimuskirjallisuus
sv: Studiehjälp

source: Religion & Spirituality
fi: Uskonto ja hengellisyys
sv: Religion och andlighet

source: Body, Mind & Spirit
fi: Keho ja mieli
sv: Kroppen, psyket och anden

source: Buddhism
fi: Buddhalaisuus

source: Christianity
fi: Kristinusko
sv: Kristendom

source: Hinduism
fi: Hindulaisuus

source: Judaism
fi: Juutalaisuus
sv: Judendom

source: Science & Technology
fi: Tiede ja teknologia
sv: Vetenskap och teknik

source: Computers
fi: Tietokoneet
sv: Datorer

source: Mathematics
fi: Matematiikka
sv: Matematik

source: Medical
fi: Lääketiede
sv: Medicin

source: Nature
fi: Luonto
sv: Natur

source: Psychology
fi: Psykologia
sv: Psykologi

source: Science
fi: Tiede
sv: Vetenskap

source: Social Sciences
fi: Yhteiskuntatieteet
sv: Samhällsvetenskap

source: Technology
fi: Teknologia
sv: Teknik

source: Plants
fi: Kasvit
sv: Växter

source: Physics & Chemistry
fi: Fysiikka ja kemia
sv: Fysik och kemi

source: Geography
fi: Maantieto
sv: Geografi

source: Stars & Space
fi: Tähdet ja avaruus
sv: Stjärnor och rymden

source: Self-Help
fi: Elämäntaito
sv: Själv-hjälp

source: Society
fi: Yhteiskunta
sv: Samhälle

source: Antiracism
fi: Antirasismi
sv: Antirasism

source: Human Rights
fi: Ihmisoikeudet
sv: Mänskliga rättigheter

source: Sports
fi: Urheilu ja liikunta
sv: Idrott

source: Football
fi: Jalkapallo
sv: Fotboll

source: Hockey
fi: Jääkiekko
sv: Ishockey

source: Dance
fi: Tanssi
sv: Dans

source: Riding
fi: Ratsastus
sv: Ridning

source: Skating
fi: Luistelu
sv: Skridskoåkning

source: Supernatural
fi: Yliluonnollinen
sv: Övernaturligt

source: Travel
fi: Matkailu
sv: Resor

source: World Record Books
fi: Ennätysten kirjat
sv: Världsrekord böcker

source: This publication meets minimum accessibility standards
fi: Tämä julkaisu noudattaa saavutettavuusstandardien alinta tasoa
sv: Publikationen uppfyller tillgänglighetskrav på en grundläggande nivå

source: This publication meets accepted accessibility standards
fi: Tämä julkaisu noudattaa saavutettavuusstandardien yleisesti hyväksyttyä tasoa
sv: Publikationen uppfyller tillgänglighetskrav på en vedertagen nivå

source: This publication exceeds accepted accessibility standards
fi: Tämä julkaisu ylittää saavutettavuusstandardien yleisesti hyväksytyn tason
sv: Publikationen uppfyller tillgänglighetskrav utöver en vedertagen nivå

source: Readable in read aloud or dynamic braille
fi: Luettavissa ruudunlukuohjelmalla tai pistenäytöllä
sv: Kan läsas med uppläsningsfunktion eller punktskriftsskärm

source: Not fully readable in read aloud or dynamic braille
fi: Ei kokonaan luettavissa ruudunlukuohjelmalla tai pistenäytöllä
sv: Inte läsbart i sin helhet med uppläsningsfunktion eller punktskriftsskärm

source: Not readable in read aloud or dynamic braille
fi: Ei luettavissa ruudunlukuohjelmalla tai pistenäytöllä
sv: Kan inte läsas med uppläsningsfunktion eller punktskriftsskärm

source: No information about nonvisual reading is available
fi: Ei tietoa tukeeko muita kuin näköön perustuvia tapoja lukea
sv: Information om icke-visuell läsbarhet saknas

source: Has alternative text
fi: Sisältää vaihtoehtoiset tekstit
sv: Har textalternativ (alt-texter)

source: Appearance can be modified
fi: Ulkoasua voi mukauttaa
sv: Utseendet kan justeras

source: Appearance cannot be modified
fi: Ulkoasua ei voi mukauttaa
sv: Utseendet kan inte justeras

source: Prerecorded audio synchronized with text
fi: Äänite on synkronoitu tekstin kanssa
sv: Förinspelat ljud synkroniserat med texten

source: Prerecorded audio only
fi: Sisältää vain ääntä
sv: Endast förinspelat ljud

source: Prerecorded audio clips
fi: Sisältää äänitteitä
sv: Förinspelade ljudklipp

source: No hazards
fi: Ei vaaratekijöitä
sv: Inga risker

source: Flashing content
fi: Välkkyvää sisältöä
sv: Blinkande innehåll

source: Motion simulation
fi: Simuloitua liikettä
sv: Rörelsesimulering

source: Sounds
fi: Ääniä
sv: Ljud

source: The presence of hazards is unknown
fi: Ei tietoa vaaratekijöistä
sv: Förekomst av ljud som kan orsaka obehag är okänd

source: No information is available
fi: Tietoa ei ole saatavilla
sv: Information saknas

source: Failure contacting external service
fi: Yhteydenotto ulkoiseen palveluun epäonnistui
sv: Det gick inte att kontakta den externa tjänsten

source: The server tried to access %(service)s but the third-party service experienced an error.
fi: Palvelin yritti käyttää palvelua %(service)s, mutta kolmannen osapuolen palvelussa tapahtui virhe.
sv: Servern försökte få åtkomst till %(service)s men tredjepartstjänsten stötte på ett fel.

source: Bad response
fi: Väärä vastaus
sv: Fel svar

source: The server made a request to %(service)s, and got an unexpected or invalid response.
fi: Palvelin teki pyynnön palveluun %(service)s ja sai odottamattoman tai virheellisen vastauksen.
sv: Servern skickade en begäran till %(service)s och fick ett oväntat eller ogiltigt svar.

source: Network failure contacting third-party service
fi: Verkkovirhe yhteydenotossa kolmannen osapuolen palveluun
sv: Nätverksfel när tredjepartstjänsten kontaktades

source: The server experienced a network error while contacting %(service)s.
fi: Palvelimella tapahtui verkkovirhe, kun se otti yhteyttä palveluun %(service)s.
sv: Servern stötte på ett nätverksfel när den försökte kontakta %(service)s.

source: Timeout
fi: Aikakatkaisu
sv: Tidsgräns överskreds

source: The server made a request to %(service)s, and that request timed out.
fi: Palvelin teki pyynnön palveluun %(service)s, ja pyyntö aikakatkaistiin.
sv: Servern skickade en begäran till %(service)s och tidsgränsen för begäran överskreds.

source: Skating stories
sv: Skridskoberättelser
